Reports/ВедомостьАмортизацииНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииНМА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияНМА</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/СтоимостьНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьНМА</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Амортизация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийНМА</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВедомостьАмортизацииНМА/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач"                   , ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон"                   , КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеВводВЭксплуатацию", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеСписание"         , Перечисления.ВидыСостоянийНМА.Списан);
	
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив               КАК НематериальныйАктив,
	|	ПервоначальныеСведения.НематериальныйАктив.Представление КАК НематериальныйАктивПредставление,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации       КАК СпособНачисления,
	|	СостояниеНМАПрием.Период                                 КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                              КАК ДатаСписания,
	|	СУММА(ПервоначальныеСведения.ПервоначальнаяСтоимость)    КАК ПервоначальнаяСтоимость,
	|	СУММА(СтоимостьНМА.СтоимостьКонечныйОстаток) 
	|		- СУММА(СтоимостьНМА.АмортизацияКонечныйОстаток)     КАК ОстаточнаяСтоимость,
	|	СУММА(ПервоначальныеСведения.ЛиквидационнаяСтоимость)    КАК ЛиквидационнаяСтоимость,
	|	СУММА(СтоимостьНМА.СтоимостьНачальныйОстаток)            КАК СтоимостьНачальныйОстаток,
	|	СУММА(СтоимостьНМА.СтоимостьПриход)                      КАК СтоимостьПриход,
	|	СУММА(СтоимостьНМА.СтоимостьРасход)                      КАК СтоимостьРасход,
	|	СУММА(СтоимостьНМА.СтоимостьОборот)                      КАК СтоимостьОборот,
	|	СУММА(СтоимостьНМА.СтоимостьКонечныйОстаток)             КАК СтоимостьКонечныйОстаток,
	|	СУММА(СтоимостьНМА.АмортизацияНачальныйОстаток)          КАК АмортизацияНачальныйОстаток,
	|	СУММА(СтоимостьНМА.АмортизацияПриход)                    КАК АмортизацияПриход,
	|	СУММА(СтоимостьНМА.АмортизацияРасход)                    КАК АмортизацияРасход,
	|	СУММА(СтоимостьНМА.АмортизацияОборот)                    КАК АмортизацияОборот,
	|	СУММА(СтоимостьНМА.АмортизацияКонечныйОстаток)           КАК АмортизацияКонечныйОстаток,
	|	МестонахождениеНМА.МОЛ КАК МОЛ,
	|	МестонахождениеНМА.Местонахождение КАК Подразделение
	|{ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив.*          КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации КАК СпособНачисления,
	|	МестонахождениеНМА.МОЛ.* КАК МОЛ,
	|	МестонахождениеНМА.Местонахождение.* КАК Подразделение,
	|	СостояниеНМАПрием.Период                           КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                        КАК ДатаСписания,
	|	ПервоначальныеСведения.НачислятьАмортизацию        КАК НачислятьАмортизацию,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования  КАК СрокПолезногоИспользования}
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(&ДатаКон,
	|	                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьНМА.ОстаткиИОбороты(
	|			                  &ДатаНач, &ДатаКон, , , 
	|			                  {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СтоимостьНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНМА.НематериальныйАктив
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияНМА.СрезПоследних(&ДатаКон, 
	|			                Состояние = &СостояниеВводВЭксплуатацию 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СостояниеНМАПрием
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СостояниеНМАПрием.НематериальныйАктив}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияНМА.СрезПоследних(
	|			                &ДатаКон, Состояние = &СостояниеСписание 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СостояниеНМАСписание
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СостояниеНМАСписание.НематериальныйАктив}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеНМА.СрезПоследних(
	|			                &ДатаКон, 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК МестонахождениеНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив}
	|{ГДЕ
	|	ПервоначальныеСведения.НачислятьАмортизацию  КАК НачислятьАмортизацию,
	|	СостояниеНМАПрием.Период                     КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                  КАК ДатаСписания}
	|
	|СГРУППИРОВАТЬ ПО
	|	ПервоначальныеСведения.НематериальныйАктив,
	|	МестонахождениеНМА.МОЛ,
	|	МестонахождениеНМА.Местонахождение,
	|	СостояниеНМАПрием.Период,
	|	СостояниеНМАСписание.Период,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.НематериальныйАктив.Представление
	|{УПОРЯДОЧИТЬ ПО
	|	СпособНачисления,
	|	НематериальныйАктив,
	|	МОЛ,
	|	Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСписания,
	|	ПервоначальнаяСтоимость,
	|	ОстаточнаяСтоимость,
	|	ЛиквидационнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьПриход,
	|	СтоимостьРасход,
	|	СтоимостьОборот,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияПриход,
	|	АмортизацияРасход,
	|	АмортизацияОборот,
	|	АмортизацияКонечныйОстаток}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ЛиквидационнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьПриход),
	|	СУММА(СтоимостьРасход),
	|	СУММА(СтоимостьОборот),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияПриход),
	|	СУММА(АмортизацияРасход),
	|	СУММА(АмортизацияОборот),
	|	СУММА(АмортизацияКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	СпособНачисления
	|{ИТОГИ ПО
	|	СпособНачисления,
	|	НематериальныйАктив.*}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "НематериальныйАктив",                         НСтр("ru='Нематериальный актив';uk='Нематеріальний актив'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",                      НСтр("ru='Дата принятия к учету';uk='Дата прийняття до обліку'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаСписания",                                НСтр("ru='Дата списания';uk='Дата списання'"));
	СтруктураПредставлениеПолей.Вставить( "СпособНачисления",                            НСтр("ru='Способ начисления амортизации';uk='Спосіб нарахування амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "НачислятьАмортизацию",                        НСтр("ru='Начислять амортизацию';uk='Нараховувати амортизацію'"));
	СтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования",                  НСтр("ru='Срок пол. использования';uk='Строк кор. використання'"));
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", НСтр("ru='Объем работ для амортизации';uk='Обсяг робіт для амортизації'"));
	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость",   НСтр("ru='Первоначальная стоимость';uk='Первинна вартість'"),    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОстаточнаяСтоимость",       НСтр("ru='Остаточная стоимость';uk='Залишкова вартість'"),        Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ЛиквидационнаяСтоимость",   НСтр("ru='Ликвидационн. стоимость';uk='Ліквідаційн. вартість'"),     Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток", НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьПриход",           НСтр("ru='Стоимость (приход)';uk='Вартість (надходження)'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьРасход",           НСтр("ru='Стоимость (расход)';uk='Вартість (витрата)'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборот",           НСтр("ru='Изменение стоимости';uk='Зміна вартості'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",  НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияНачальныйОстаток", НСтр("ru='Амортизация на начало периода';uk='Амортизація на початок періоду'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияПриход",           НСтр("ru='Амортизация (приход)';uk='Амортизація (прибуток)'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияРасход",           НСтр("ru='Амортизация (расход)';uk='Амортизація (витрата)'"),          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",           НСтр("ru='Амортизация за период';uk='Амортизація за період'"),         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияКонечныйОстаток",  НСтр("ru='Амортизация на конец периода';uk='Амортизація на кінець періоду'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("НематериальныйАктив");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "СтоимостьНМА";
ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Ведомость амортизации НМА';uk='Відомість амортизації НМА'");
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;

#КонецЕсли
